



*** COMMENT shx

Commented out in an attempt to speed up evaluation in R and Stata... and BINGO!!! this was the little motherfucker that made R and Stata super slow interactively. It also caused an error on exit.

Enhance comint-mode. See https://github.com/riscy/shx-for-emacsl

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package shx
    :defer t
    :init (shx-global-mode 1))
#+END_SRC

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (23563 38338 822346 339000) :init (23563 38338 822317 934000) :config (23563 38338 821844 459000) :config-secs (0 0 13 374000) :init-secs (0 0 2171 786000) :use-package-secs (0 0 2344 520000)))

Alternativa from https://github.com/malb/emacs.d/blob/master/malb.org

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package shx
    :defer t
    :after comint
    :config (progn
              ;;(with-eval-after-load 'python
              ;;  (add-hook 'inferior-python-mode-hook #'shx-mode))
              ;; (with-eval-after-load 'sage-shell-mode
              ;;   (add-hook 'sage-shell-mode-hook #'shx-mode))
              (with-eval-after-load 'shell
                (add-hook 'shell-mode-hook #'shx-mode)))
    ;; from https://github.com/riscy/shx-for-emacs
    (setq
     ;; vastly improve display performance by breaking up long output lines
     shx-max-output 1024
     ;; prevent input longer than macOS's typeahead buffer from going through
     shx-max-input 1024
     ;; prefer inlined images to have a height of 250 pixels
     shx-img-height 250
     ;; don't show any incidental hint messages about how to use shx
     shx-show-hints nil
     ;; flash the previous comint prompt for a full second when using C-c C-p
     shx-flash-prompt-time 1.0
     ;; use `#' to prefix shx commands instead of the default `:'
     shx-leader "#"))
#+END_SRC

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (23563 39460 592701 842000) :init (23563 39460 592655 127000) :config (23563 39460 592361 613000) :config-secs (0 0 651 835000) :init-secs (0 0 1187 492000) :use-package-secs (0 0 1286 219000)))

***** COMMENT Hungry deletion
On the list of things I like doing, deleting big whitespaces is pretty close to the bottom. Backspace or Delete will get rid of all whitespace until the next non-whitespace character is encountered. You may not like it, thus disable it if you must, but it’s pretty decent.

DGM: I am commenting this out as I found it annoying when, for example, editing ledger files and wanting to delete spaces one by one I found the cursor deleting all the white space and thus indening lines in the wrong manner. La sensacion era como si el buffer estuviera tabify when it wasn't... So I wasn't understanding what was going on until I recalled I had this mode enabled.

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package hungry-delete
    :defer t
    :config
    (global-hungry-delete-mode))
#+END_SRC

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (23554 33611 672389 982000) :init (23554 33611 672357 93000) :config (23554 33611 672016 76000) :config-secs (0 0 2391 739000) :init-secs (0 0 3160 173000) :use-package-secs (0 0 3365 347000)))

****** Beacon
While changing buffers or workspaces, the first thing you do is look for your cursor. Unless you know its position, you cannot move it efficiently. Every time you change buffers, the current position of your cursor will be briefly highlighted now.

As much as I like it, it produces interferences.

#+BEGIN_SRC emacs-lisp :tangle no
  (use-package beacon
    :defer t
    :config
    (beacon-mode 1))
#+END_SRC

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (24174 25303 116491 741000) :init (24174 25303 116448 801000) :config (24174 25303 115167 252000) :config-secs (0 0 2126 491000) :init-secs (0 0 4012 662000) :use-package-secs (0 0 4173 185000)))


